<!-- add-pr-comment:add-pr-comment -->

aws_s3_bucket.static_pages: Refreshing state... [id=note-app-static-pages]
aws_cloudfront_origin_access_control.note_app_oac: Refreshing state... [id=EP34N1TT7FO74]
aws_cloudfront_distribution.note_app_cfront: Refreshing state... [id=E35CO338AZ8MF7]
aws_s3_bucket_policy.static_website: Refreshing state... [id=note-app-static-pages]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.policy_document will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "policy_document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::note-app-static-pages",
              + "arn:aws:s3:::note-app-static-pages/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::958933161565:distribution/E35CO338AZ8MF7",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.note_app_cfront will be updated in-place
  ~ resource "aws_cloudfront_distribution" "note_app_cfront" {
        id                              = "E35CO338AZ8MF7"
        tags                            = {}
        # (22 unchanged attributes hidden)

      + custom_error_response {
          + error_caching_min_ttl = 10
          + error_code            = 403
          + response_code         = 200
          + response_page_path    = "/"
        }

        # (4 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.static_website will be updated in-place
  ~ resource "aws_s3_bucket_policy" "static_website" {
        id     = "note-app-static-pages"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceArn" = "arn:aws:cloudfront::958933161565:distribution/E35CO338AZ8MF7"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::note-app-static-pages/*",
                          - "arn:aws:s3:::note-app-static-pages",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
